{"reviewerID": "AHQH515MRVQ2V", "asin": "B00LPPDX9O", "reviewerName": "jane doe", "helpful": [0, 0], "reviewText": "This neat little guide will clarify for you things that you were stressing out about with regards to applying to law school.  I'm talking about things like DUIs, criminal records, bad grades, and school disciplinary actions. It seems like the more you can relieve stress in your mind, the better you feel and, believe me, a lot of stress will dissipate after a read.  There is no way you can get this vital information in one spot like this anywhere else, so...put it in your cart!", "overall": 5.0, "summary": "I'm talking about things like DUIs, criminal records", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
{"reviewerID": "A3UFNFWVPDPVHX", "asin": "B00LPPDX9O", "reviewerName": "Jason Walker", "helpful": [0, 0], "reviewText": "While it covers some good issues and various likely situations, especially common circumstances when drafting an addendum is needed, it feels a little too generic and could certainly cover more material. Nevertheless, it is certainly helpful read.", "overall": 3.0, "summary": "While it covers some good issues and various likely situations", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
{"reviewerID": "A1KRAD2KO010B4", "asin": "B00LPPDX9O", "reviewerName": "Katie S", "helpful": [0, 0], "reviewText": "This guide to law school addenda does an excellent job of laying out the necessary structure and approach to creating an effective law school addendum.  For those individuals who need to include an addendum with their application - for whatever reason - it is incredibly important to present and handle the issue in the right way.  This guide instructs applicants in a clear way about how to do exactly that.  I would highly recommend it to anyone who has determined that an addendum to their law school application is necessary.  One caveat: this guide does not - nor does it claim to - help applicants to determine whether an application addendum will be beneficial or necessary.  Peg raises the question and provides advice to applicants about how to approach that assessment.  Once applicants have decided it is necessary, however, this is the book to use!", "overall": 5.0, "summary": "Clear and concise guide to writing an effective addendum", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
